# Первое задание
print("Чехов"[0])
print("Чехов"[1])
print("Чехов"[2])
print("Чехов"[3])
print("Чехов"[4])

# Второе задание
print("Вчера  написал {}. Вчера я ходил в {}.".format(input("Что вы вчера написали?: "), input("Куда вы вчера ходили?: ")))

# Третье задание
print("олдос ".capitalize() + "Хаксли родился в 1894 году.")

# Четвёртое задание
print("Где это? Кто это? Когда это?".split("?"))

# Пятое задание
x = ["Рыжая", "лиса", "перепрыгнула", "через", "низкий", "забор", "."]
print(" ".join(x[:6]) + x[6])

# Шестое задание
print("Ребёнок - зеркало поступков родителей.".replace("о", "0"))

# Седьмое задание
print("Хемингуэй".index("м"))

# Восьмое задание
print\
('''
- Идёмте, - выдавил из себя Марвин. - Мне приказано привезти вас в рубку.
Мне, с моим могучим интеллектом, приказывают привезти вас в рубку...
И это называется "удовлетворение от работы"?
''')
print\
('''
- Но что делать с роботом, страдающим маниакальной депрессией?
- Разве это проблема? - молвил Марвин с таким видом, будто обращался к гробу,
куда только что опустили покойника. - А вот что делать, если ты действительно робот,
страдающий маниакальной депрессией?.. Можете зря не стараться. Я в пятьдесят тысяч раз
умнее вас и всё равно не знаю ответа.
''')

# Девятое задание
print("три" + "три" + "три")
print("три" * 3)

# Десятое задание
sentence = "И незачем так орать! Я и в первый раз прекрасно слышал."
print(sentence.index("."))
print(sentence[:19])









