# Первое задание
echo Self-taught

# Второе задание
pmd 
cd /Users/user/Decktop
cd Программирование/Саша/Уроки - Сам себе Программист/Часть III. Введение в инструменты программирования
ls # или
cd ..
cd /Users/user/Decktop/Программирование/Саша/Уроки - Сам себе Программист/Часть III. Введение в инструменты программирования
ls

# Третье задание
export python_projects=/Users/user/Decktop/Программирование/Саша/Уроки - Сам себе Программист
taught .profile # Далее нужно ввести в созданный файл строку кода выше
cd $python_projects